In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import missingno as msno
import warnings 
%matplotlib inline

In [5]:
data = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv',index_col = 'PassengerId')

In [6]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [12]:
data.shape

(891, 11)

In [9]:
##null variables are in Age, Cabin, Embarked columns
data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [23]:
#missing percentages
[(feature, 'column has ', round(data[feature].isnull().mean()*100, 3), '% missing values') for feature in df.columns if data[feature].isnull().sum()>0]

[('Age', 'column has ', 19.865, '% missing values'),
 ('Cabin', 'column has ', 77.104, '% missing values'),
 ('Embarked', 'column has ', 0.224, '% missing values')]

In [10]:
#unique values

df = data.copy()
[(feature, len(data[feature].unique())) for feature in df.columns ]

[('Survived', 2),
 ('Pclass', 3),
 ('Name', 891),
 ('Sex', 2),
 ('Age', 89),
 ('SibSp', 7),
 ('Parch', 7),
 ('Ticket', 681),
 ('Fare', 248),
 ('Cabin', 148),
 ('Embarked', 4)]

In [13]:
#categorical_variables

[feature for feature in data.columns if len(data[feature].unique())<8]

['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']

In [14]:
categorical_feat = [feature for feature in data.columns if len(data[feature].unique())<8]

In [38]:
#Encoding the categories
data['Sex'] = data['Sex'].map({'female':0, 'male':1})

In [42]:
print(data['Parch'].unique())
print(data['Embarked'].unique())

[0 1 2 5 3 4 6]
['S' 'C' 'Q' nan]

In [27]:
#continuous features
set(data.columns)- set(categorical_feat)

{'Age', 'Cabin', 'Fare', 'Name', 'Ticket'}

In [28]:
candiadate_continuous_feat = set(data.columns)- set(categorical_feat)

In [29]:
data[continuous_feat].head()

,Ticket,Name,Fare,Age,Cabin
PassengerId,,,,,
1,A/5 21171,"Braund, Mr. Owen Harris",7.2500,22.0,NaN
2,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",71.2833,38.0,C85
3,STON/O2. 3101282,"Heikkinen, Miss. Laina",7.9250,26.0,NaN
4,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",53.1000,35.0,C123
5,373450,"Allen, Mr. William Henry",8.0500,35.0,NaN

In [31]:
data[continuous_feat].dtypes

Ticket     object
Name       object
Fare      float64
Age       float64
Cabin      object
dtype: object

In [34]:
#Check iif duplicated rows are available
data.duplicated().sum()

0